ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_audio.c
/**
  ******************************************************************************
  * @file    bl606p_audio.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl606p_audio.h"
#include "audio_reg.h"

/** @addtogroup  BL606P_Peripheral_Driver
 *  @{
 */

/** @addtogroup  AUDIO
 *  @{
 */

/** @defgroup  AUDIO_Private_Macros
 *  @{
 */

/*@} end of group AUDIO_Private_Macros */

/** @defgroup  AUDIO_Private_Types
 *  @{
 */

/*@} end of group AUDIO_Private_Types */

/** @defgroup  AUDIO_Private_Variables
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *audioIntCbfArra[AUDIO_INT_NUM_ALL] = { NULL };
#endif
/*@} end of group AUDIO_Private_Variables */

/** @defgroup  AUDIO_Global_Variables
 *  @{
 */

/*@} end of group AUDIO_Global_Variables */

/** @defgroup  AUDIO_Private_Fun_Declaration
 *  @{
 */

/*@} end of group AUDIO_Private_Fun_Declaration */

/** @defgroup  AUDIO_Private_Functions
 *  @{
 */

/*@} end of group AUDIO_Private_Functions */

/** @defgroup  AUDIO_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Select Tx channel source Defaule is tx0-dac_0,tx1-dac_1
 *
 * @param  tx_channel: tx_channel index . Note tx_channel <=2
 * @param  dac_id: tx[rx_channel] conect to dac_id
 *
 * @return Success or not
 *
*******************************************************************************/
BL_Err_Type Audio_Tx_Source_DAC_Sel(uint8_t tx_channel, Audio_DAC_ID_Type dac_id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DAC_ID_TYPE(dac_id));

    if (tx_channel > 2) {
        return ERROR;
        /*tx channel sel can not larger than 2*/
    }

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);

    if (tx_channel == 0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_TX0_SEL, dac_id);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_TX1_SEL, dac_id);
    }

    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Select Rx channel form ADC Channel . source Default selction is
 *         rx0-adc_0,rx1-adc_1,rx2-adc_2,rx3-aec_0,rx4-aec_1
 *
 * @param  rx_channel: rx_channel index . Note tx_channel <=4
 * @param  adc_id: rx[rx_channel] conect to adc_id
 *
 * @return Success or not
 *
*******************************************************************************/
BL_Err_Type Audio_Rx_Source_ADC_Sel(uint8_t rx_channel, Audio_ADC_ID_Type adc_id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));

    if (rx_channel > 4) {
        return ERROR;
        /*rx channel sel can not larger than 4*/
    }

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);

    switch (rx_channel) {
        case 0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX0_SEL, adc_id);
            break;
        case 1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX1_SEL, adc_id);
            break;
        case 2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX2_SEL, adc_id);
            break;
        case 3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX3_SEL, adc_id);
            break;
        case 4:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX4_SEL, adc_id);
            break;
        default:
            break;
    }

    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Select Rx channel form AEC Channel . source Default selction is
 *         rx0-adc_0,rx1-adc_1,rx2-adc_2,rx3-aec_0,rx4-aec_1
 *
 * @param  rx_channel: tx_channel index . Note tx_channel <=4
 * @param  aec_id: rx[rx_channel] conect to aec_id
 *
 * @return Success or not
 *
*******************************************************************************/
BL_Err_Type Audio_Rx_Source_AEC_Sel(uint8_t rx_channel, Audio_AEC_ID_Type aec_id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_AEC_ID_TYPE(aec_id));

    if (rx_channel > 4) {
        return ERROR;
        /*rx channel sel can not larger than 4*/
    }

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);

    switch (rx_channel) {
        case 0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX0_SEL, aec_id + 3);
            break;
        case 1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX1_SEL, aec_id + 3);
            break;
        case 2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX2_SEL, aec_id + 3);
            break;
        case 3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX3_SEL, aec_id + 3);
            break;
        case 4:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AUD_RX4_SEL, aec_id + 3);
            break;
        default:
            break;
    }

