ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_audio.c
    if (id == AUDIO_ADC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_0_FIR_MODE, enable);
    } else if (id == AUDIO_ADC_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_FIR_MODE, enable);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_2_FIR_MODE, enable);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_ADC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  mixer setting function
 *
 * @param  enable: enbale mixer or not,if disable mixer then other parameter is invalid
 * @param  mixerId: mixer Id,audio have two mixer to selected
 * @param  mode: mixer mode selection , debug mode or sidetone mode(other source is come form
 *               adc0-adc2)
 * @param  sidetoneChannel: mixer adc channel selection , if debug mode is selected this paramter is
 *                          used , or user must select which adc source will be mixed with dac output.
 * @param  Volume: mixer Volume select
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_Mixer_Mode(uint8_t enable, Audio_Mixer_ID_Type mixerId, Audio_Mixer_Mode mode, Audio_ADC_ID_Type sidetoneChannel, Audio_Mixer_Volume_Type Volume)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_MIXER_ID_TYPE(sidetoneChannel));
    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(sidetoneChannel));
    CHECK_PARAM(IS_AUDIO_MIXER_VOLUME_TYPE(Volume));
    CHECK_PARAM(IS_AUDIO_MIXER_MODE(mode));

    if (mixerId == AUDIO_MIXER_ID_0) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_0);
    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_1);
    }

    if (enable) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MIX_0_MODE, mode);
        if (mode == AUDIO_SECOND_DEBUG_MODE) {
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MIX_0_ATT_MODE1, Volume);
        } else {
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MIX_0_SEL, sidetoneChannel + 1);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MIX_0_ATT_MODE2, Volume);
        }
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MIX_0_MODE, 0);
    }

    if (mixerId == AUDIO_MIXER_ID_0) {
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_0, tmpVal);
    } else {
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_1, tmpVal);
    }
}

/****************************************************************************/ /**
 * @brief  set adc swap
 *
 * @param  id: Auido ADC ID
 * @param  swap: swap
 *
 * @return None
 *
*******************************************************************************/
void Audio_ADC_Mash_Bit_Swap(Audio_ADC_ID_Type id, uint8_t swap)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_0);
    if (id == AUDIO_ADC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_0_MASH_BIT_SWAP, swap);
    } else if (id == AUDIO_ADC_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_MASH_BIT_SWAP, swap);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_2_MASH_BIT_SWAP, swap);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set pdm inv
 *
 * @param  id: Auido ADC ID
 * @param  swap: inv
 *
 * @return None
 *
*******************************************************************************/
void Audio_ADC_PDM_Inv_Swap(Audio_ADC_ID_Type id, uint8_t swap)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_0);
    if (id == AUDIO_ADC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_PDM_LVL_SWAP, swap);
    } else if (id == AUDIO_ADC_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_PDM_LVL_SWAP, swap);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_PDM_LVL_SWAP, swap);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set pdm value
 *
 * @param  pdm_l: pdm l
 * @param  pdm_h: pdm h
 *
 * @return None
 *
*******************************************************************************/
void Audio_ADC_Set_PDM_Value(uint8_t pdm_l, uint8_t pdm_h)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_PDM_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_PDM_L, pdm_l);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_PDM_H, pdm_l);
    BL_WR_REG(AUDIO_BASE, AUDIO_PDM_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio_Set_AEC_Record_Vid
 *
 * @param  enable: enable or not
 * @param  div: div
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_AEC_Record_Vid(uint8_t enable, uint8_t div)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AEC_0);

    if (enable) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AEC_RECORD_VLD_4S_EN, 1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AEC_RECORD_VLD_4S_DIV, div);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AEC_RECORD_VLD_4S_EN, 0);
    }

    BL_WR_REG(AUDIO_BASE, AUDIO_AEC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio_Set_AEC_Atten_mode
 *
 * @param  aec_id: AEC ID
 * @param  mode: Atten Mode
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_AEC_Atten_mode(Audio_AEC_ID_Type aec_id, Audio_AEC_Atten_Mode mode)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_AEC_ID_TYPE(aec_id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AEC_0);

    if (aec_id == AUDIO_AEC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AEC_0_ATTEN_MODE, mode);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AEC_1_ATTEN_MODE, mode);
    }

    BL_WR_REG(AUDIO_BASE, AUDIO_AEC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio support three channel for pdm .Meanwhile Audio support two DMIC Interface which
 *         supporting four pdm data source input.This function is used to select channel with pdm
 *         source.
 *
 * @param  id: pdm channel,cannot be larger than 3
 * @param  pdmSel: pdm source select
 *
 * @return Success or not
 *
*******************************************************************************/
void Audio_ADC_PDM_Channel_Sel(Audio_PDM_ID_Type id, Audio_PDM_Source_Type pdmSel)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_PDM_SOURCE_TYPE(pdmSel));
    CHECK_PARAM(IS_AUDIO_PDM_ID_TYPE(id));

