ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_audio.c
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_PDM_0);

    if (id == AUDIO_PDM_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_0_PDM_SEL, pdmSel);
    } else if (id == AUDIO_PDM_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_PDM_SEL, pdmSel);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_2_PDM_SEL, pdmSel);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_PDM_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio Enable PDM
 *
 * @param  id: PDM ID
 *
 * @return Success or not
 *
*******************************************************************************/
void Audio_ADC_PDM_Enable(Audio_PDM_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_PDM_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_PDM_0);

    if (id == AUDIO_PDM_0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_PDM_0_EN);
    } else if (id == AUDIO_PDM_1) {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_PDM_1_EN);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_PDM_2_EN);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_PDM_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio Disable PDM
 *
 * @param  id: None
 *
 * @return Success or not
 *
*******************************************************************************/
void Audio_ADC_PDM_Disable(Audio_PDM_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_PDM_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_PDM_0);

    if (id == AUDIO_PDM_0) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_PDM_0_EN);
    } else if (id == AUDIO_PDM_1) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_PDM_0_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_PDM_0_EN);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_PDM_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  debug 0x24 reigister
 *
 * @param  wCmd: None
 *
 * @return None
 *
*******************************************************************************/
void Debug0_Write(uint32_t wCmd)
{
    BL_WR_REG(AUDIO_BASE, AUDIO_DBG_0, wCmd);
}

/****************************************************************************/ /**
 * @brief  debug 0x28 reigister
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
uint32_t Debug1_Read(void)
{
    return BL_RD_REG(AUDIO_BASE, AUDIO_DBG_1);
}

/****************************************************************************/ /**
 * @brief  debug 0x2c reigister
 *
 * @param  wCmd: None
 *
 * @return None
 *
*******************************************************************************/
void Debug2_Write(uint32_t wCmd)
{
    BL_WR_REG(AUDIO_BASE, AUDIO_DBG_2, wCmd);
}

/****************************************************************************/ /**
 * @brief  debug 0x30 reigister
 *
 * @param  wCmd: None
 *
 * @return None
 *
*******************************************************************************/
void Debug3_Write(uint32_t wCmd)
{
    BL_WR_REG(AUDIO_BASE, AUDIO_DBG_3, wCmd);
}

/****************************************************************************/ /**
 * @brief  AUDIO Interrupt mask
 *
 * @param  intType: intType
 * @param  intMask: intMask
 *
 * @return None
 *
*******************************************************************************/
void Auido_IntMask(Audio_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    switch (intType) {
        case AUDIO_INT_RX_FIFO_THR:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_RXA_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXA_INT_EN);
            }
            BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);
            break;
        case AUDIO_INT_RX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_RXO_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXO_INT_EN);
            }
            BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);
            break;
        case AUDIO_INT_RX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_RXU_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXU_INT_EN);
            }
            BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);
            break;

        case AUDIO_INT_TX_FIFO_THR:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_TXA_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXA_INT_EN);
            }
            BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);
            break;
        case AUDIO_INT_TX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_TXO_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXO_INT_EN);
            }
            BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);
            break;
        case AUDIO_INT_TX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_TXU_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXU_INT_EN);
            }
            BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);
            break;

        case AUDIO_INT_ADC0_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_INT_CLR, intMask);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);
            break;
        case AUDIO_INT_ADC1_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal = BL_SET_REG_BITS_VAL(AUDIO_BASE, AUDIO_ADC_S1_INT_CLR, intMask);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);
            break;

        case AUDIO_INT_ADC2_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S2_INT_CLR, intMask);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);
            break;
        case AUDIO_INT_DAC0_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_INT_CLR, intMask);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);
            break;
        case AUDIO_INT_DAC1_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S1_INT_CLR, intMask);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);
            break;
        case AUDIO_INT_VAD:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_INT_CLR, intMask);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);
            break;
        case AUDIO_INT_NUM_ALL:
            if (intMask) {
                tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_RXA_INT_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_RXU_INT_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_RXO_INT_EN);
                BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);

                tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_TXA_INT_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_TXU_INT_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_TXO_INT_EN);

                BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);

                BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, 0x40A0A80);
            } else {
                tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXA_INT_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXU_INT_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXO_INT_EN);
                BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);

                tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXA_INT_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXU_INT_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXO_INT_EN);

                BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);

                BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, 0);
            }

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  clear audio Interrupt flag
 *
 * @param  intType: intType
 *
 * @return None
 *
*******************************************************************************/
void Auido_IntClear(Audio_INT_Type intType)
{
    uint32_t tmpVal = 0;
    uint32_t tmpVal2 = 0;

    CHECK_PARAM(IS_AUDIO_INT_TYPE(intType));

    switch (intType) {
        case AUDIO_INT_RX_FIFO_THR:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXA_INT);
            BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS, tmpVal);
            break;
        case AUDIO_INT_RX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXO_INT);
            BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS, tmpVal);
            break;
        case AUDIO_INT_RX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(AUDIO_BASE, AUDIO_RXU_INT);
            BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS, tmpVal);
            break;

        case AUDIO_INT_TX_FIFO_THR:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXA_INT);
            BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS, tmpVal);
            break;
        case AUDIO_INT_TX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXO_INT);
            BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS, tmpVal);
            break;
        case AUDIO_INT_TX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXU_INT);
            BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS, tmpVal);
            break;

