ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_audio.c
        case AUDIO_INT_ADC0_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal2 = tmpVal;
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_INT_CLR, 1);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);

            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal2);
            break;
        case AUDIO_INT_ADC1_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal2 = tmpVal;
            tmpVal = BL_SET_REG_BITS_VAL(AUDIO_BASE, AUDIO_ADC_S1_INT_CLR, 1);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);

            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal2);
            break;

        case AUDIO_INT_ADC2_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal2 = tmpVal;
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S2_INT_CLR, 1);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);

            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal2);
            break;
        case AUDIO_INT_DAC0_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal2 = tmpVal;
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_INT_CLR, 1);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);

            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal2);
            break;
        case AUDIO_INT_DAC1_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal2 = tmpVal;
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S1_INT_CLR, 1);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);

            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal2);
            break;
        case AUDIO_INT_VAD:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            tmpVal2 = tmpVal;
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_INT_CLR, 1);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);

            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal2);
            break;
        case AUDIO_INT_NUM_ALL:

            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS);

            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXA_INT);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXU_INT);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RXO_INT);

            BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS, tmpVal);

            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS);

            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXA_INT);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXU_INT);
            tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TXO_INT);

            BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS, tmpVal);

            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);

            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal | 0x40A0A80);
            BL_WR_REG(AUDIO_BASE, AUDIO_STATUS, tmpVal);

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  register interrupt callback function pointer
 *
 * @param  intType: intType
 * @param  cbFun: cbFun
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
BL_Err_Type Audio_Int_Callback_Install(Audio_INT_Type intType, intCallback_Type *cbFun)
{
    CHECK_PARAM(IS_AUDIO_INT_TYPE(intType));

    audioIntCbfArra[intType] = cbFun;

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  read int flag
 *
 * @param  intType: intType
 *
 * @return flag status
 *
*******************************************************************************/
BL_Sts_Type Audio_GetIntStatus(Audio_INT_Type intType)
{
    uint32_t tmpVal = 0;
    BL_Sts_Type rlt = RESET;

    CHECK_PARAM(IS_AUDIO_INT_TYPE(intType));

    switch (intType) {
        case AUDIO_INT_RX_FIFO_THR:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_RXA_INT);
            break;
        case AUDIO_INT_RX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_RXO_INT);
            break;
        case AUDIO_INT_RX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_RXU_INT);
            break;

        case AUDIO_INT_TX_FIFO_THR:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_TXA_INT);
            break;
        case AUDIO_INT_TX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_TXO_INT);
            break;
        case AUDIO_INT_TX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_TXU_INT);
            break;

        case AUDIO_INT_ADC0_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_S0_INT);
            break;
        case AUDIO_INT_ADC1_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_S1_INT);
            break;

        case AUDIO_INT_ADC2_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_S2_INT);
            break;
        case AUDIO_INT_DAC0_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_DAC_S0_INT);
            break;
        case AUDIO_INT_DAC1_SET_VOLUME_DONE:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_DAC_S1_INT);
            break;
        case AUDIO_INT_VAD:
            tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, AUDIO_VAD_INT);
            break;
        default:
            break;
    }

    return rlt;
}

/****************************************************************************/ /**
 * @brief  rx fifo flush
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Audio_RxFifoClear(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);
    tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_RX_FIFO_FLUSH);
    BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get Rx FIFO Count
 *
 * @param  None
 *
 * @return fifi count
 *
*******************************************************************************/
uint32_t Audio_GetRxFifoCount(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, AUDIO_RXA_CNT);

