ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_audio.c
    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  Read RX FIFO
 *
 * @param  None
 *
 * @return fifo data
 *
*******************************************************************************/
uint32_t Audio_ReadRxFifo(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_DATA);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  tx fifo flush
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Audio_TxFifoClear(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);
    tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_TX_FIFO_FLUSH);
    BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get Tx FIFO Count
 *
 * @param  None
 *
 * @return fifi count
 *
*******************************************************************************/
uint32_t Audio_GetTxFifoCount(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, AUDIO_TXA_CNT);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  Wirte TX FIFO
 *
 * @param  da: None
 *
 * @return fifo data
 *
*******************************************************************************/
void Audio_WriteTxFifo(uint32_t da)
{
    BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_DATA, da);
}

/****************************************************************************/ /**
 * @brief  Configure rx fifo
 *
 * @param  cfg: fifo cfg
 *
 * @return None
 *
*******************************************************************************/
void Audio_RxFifoConfig(Audio_FifoCfg_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_RESOLUTION_TYPE(cfg->resolution));
    CHECK_PARAM(IS_AUDIO_FIFO_AILGN_MODE(cfg->ailgnMode));
    CHECK_PARAM(IS_AUDIO_FIFO_DQR_THRESHOLD_MODE(cfg->dmaThresholdMode));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_RX_DATA_RES, cfg->resolution);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_RX_DATA_MODE, cfg->ailgnMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_RX_DRQ_CNT, cfg->dmaThresholdMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_RX_TRG_LEVEL, cfg->FifoIntThreshold);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_RX_DRQ_EN, cfg->dmaEn);

    BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_ITF_EN, cfg->dmaEn);
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  enable rx fifo
 *
 * @param  ch: ch
 *
 * @return None
 *
*******************************************************************************/
void Audio_RxFifoEnable(uint8_t ch)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_RX_CH_EN, ch);
    BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  disable rx fifo
 *
 * @param  ch: fifo cfg
 *
 * @return None
 *
*******************************************************************************/
void Audio_RxFifoDisable(uint8_t ch)
{
    uint32_t tmpVal = 0;
    uint32_t tmpVal2 = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL);
    tmpVal2 = BL_GET_REG_BITS_VAL(tmpVal, AUDIO_RX_CH_EN);

    tmpVal2 &= ~ch;

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_RX_CH_EN, tmpVal2);

    BL_WR_REG(AUDIO_BASE, AUDIO_RX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  enable rx fifo
 *
 * @param  ch: ch
 *
 * @return None
 *
*******************************************************************************/
void Audio_TxFifoEnable(uint8_t ch)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_TX_CH_EN, ch);
    BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  disable rx fifo
 *
 * @param  ch: fifo cfg
 *
 * @return None
 *
*******************************************************************************/
void Audio_TxFifoDisable(uint8_t ch)
{
    uint32_t tmpVal = 0;
    uint32_t tmpVal2 = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);
    tmpVal2 = BL_GET_REG_BITS_VAL(tmpVal, AUDIO_TX_CH_EN);

    tmpVal2 &= ~ch;

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_TX_CH_EN, tmpVal2);

    BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get Tx FIFO Count
 *
 * @param  cfg: None
 *
 * @return None
 *
*******************************************************************************/
void Audio_TxFifoConfig(Audio_FifoCfg_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_RESOLUTION_TYPE(cfg->resolution));
    CHECK_PARAM(IS_AUDIO_FIFO_AILGN_MODE(cfg->ailgnMode));
    CHECK_PARAM(IS_AUDIO_FIFO_DQR_THRESHOLD_MODE(cfg->dmaThresholdMode));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_TX_DATA_RES, cfg->resolution);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_TX_DATA_MODE, cfg->ailgnMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_TX_DRQ_CNT, cfg->dmaThresholdMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_TX_TRG_LEVEL, cfg->FifoIntThreshold);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_TX_DRQ_EN, cfg->dmaEn);

    BL_WR_REG(AUDIO_BASE, AUDIO_TX_FIFO_CTRL, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_ITF_EN, cfg->dmaEn);
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio_PEQ_Config
 *
 * @param  peq_index: PEQ index should be in range[0,19]
 * @param  peqBypass: PEQ is bypass,if bypass b_pra and a_pra is vaild
 * @param  qtfm: PEQ qtfm
 * @param  b_pra: PEQ b_pra ,should be set as [19:0] arrary pointer which length is 3
 * @param  a_pra: PEQ a_bra ,should be set as [19:0] arrary pointer which length is 2
 *
 * @return PEQ Setting is success or not
 *
*******************************************************************************/
BL_Err_Type Audio_DAC_PEQ_Config(uint8_t peq_index, uint8_t peqBypass, Audio_PEQ_QTFM_Type qtfm, uint32_t *b_pra, uint32_t *a_pra)
{
    uint32_t tmpVal = 0;
    uint32_t peqAddr = 0;
    if (peq_index > 19) {
        return ERROR;
        /* PEQ only support [0,19] index */
    }
    peqAddr = AUDIO_BASE + 0x200 + (peq_index * 0x14);

