ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_audio.c
    if (peqBypass == 0) {
        tmpVal = BL_RD_WORD(peqAddr);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PEQ_00_B0, b_pra[0]);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PEQ_00_QFMT, qtfm);

        BL_WR_WORD(peqAddr, tmpVal);

        BL_WR_WORD(peqAddr + 0x04, b_pra[1]);
        BL_WR_WORD(peqAddr + 0x08, b_pra[2]);
        BL_WR_WORD(peqAddr + 0x0c, a_pra[0]);
        BL_WR_WORD(peqAddr + 0x10, a_pra[1]);

        tmpVal = BL_RD_WORD(peqAddr);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PEQ_00_BYP, peqBypass);
        BL_WR_WORD(peqAddr, tmpVal);

    } else {
        tmpVal = BL_RD_WORD(peqAddr);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PEQ_00_BYP, peqBypass);
        BL_WR_WORD(peqAddr, tmpVal);
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio_ADC_PEQ_Config
 *
 * @param  peq_index: PEQ index should be in range[0,19]
 * @param  peqBypass: PEQ is bypass,if bypass b_pra and a_pra is vaild
 * @param  qtfm: PEQ qtfm
 * @param  b_pra: PEQ b_pra ,should be set as [19:0] arrary pointer which length is 3
 * @param  a_pra: PEQ a_bra ,should be set as [19:0] arrary pointer which length is 2
 *
 * @return PEQ Setting is success or not
 *
*******************************************************************************/
BL_Err_Type Audio_ADC_PEQ_Config(uint8_t peq_index, Audio_ADC_ID_Type adcChannel, uint8_t peqBypass, Audio_PEQ_QTFM_Type qtfm, uint32_t *b_pra, uint32_t *a_pra)
{
    uint32_t tmpVal = 0;
    uint32_t peqAddr = 0;
    if (peq_index > 19) {
        return ERROR;
        /* PEQ only support [0,19] index */
    }
    peqAddr = AUDIO_BASE + 0x390 + (peq_index * 0x14);

    tmpVal = BL_RD_WORD(AUDIO_BASE + 0x390);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_PEQ_IN_SEL, adcChannel);
    BL_WR_WORD(peqAddr, tmpVal);

    if (peqBypass == 0) {
        tmpVal = BL_RD_WORD(peqAddr);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PEQ_20_B0, b_pra[0]);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PEQ_20_QFMT, qtfm);

        BL_WR_WORD(peqAddr, tmpVal);

        BL_WR_WORD(peqAddr + 0x04, b_pra[1]);
        BL_WR_WORD(peqAddr + 0x08, b_pra[2]);
        BL_WR_WORD(peqAddr + 0x0c, a_pra[0]);
        BL_WR_WORD(peqAddr + 0x10, a_pra[1]);

        tmpVal = BL_RD_WORD(peqAddr);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PEQ_20_BYP, peqBypass);
        BL_WR_WORD(peqAddr, tmpVal);

    } else {
        tmpVal = BL_RD_WORD(peqAddr);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PEQ_20_BYP, peqBypass);
        BL_WR_WORD(peqAddr, tmpVal);
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio adc Mute
 *
 * @param  muteSyncAllAdc: mute Sync All ADC Channle
 * @param  adc_id: adc id
 * @param  mute: Mute Or Not
 *
 * @return success or not
 *
*******************************************************************************/
BL_Err_Type Audio_ADC_Set_Mute(BL_Fun_Type muteSyncAllAdc, Audio_ADC_ID_Type adc_id, Audio_Mute_Type mute)
{
    uint32_t tmpVal = 0;
    uint32_t adcVolumeConfigAddrOffset = AUDIO_BASE + 0x408 + adc_id * 0x08;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));
    CHECK_PARAM(IS_AUDIO_MUTE_TYPE(mute));

    if (muteSyncAllAdc) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_S0_MISC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S012_MUTE, mute);
        BL_WR_REG(AUDIO_BASE, AUDIO_ADC_S0_MISC, tmpVal);
    } else {
        if (adc_id > 2) {
            return ERROR;
            /*only support 3 adc*/
        }

        tmpVal = BL_RD_WORD(adcVolumeConfigAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_MUTE, mute);
        BL_WR_WORD(adcVolumeConfigAddrOffset, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio adc Mute
 *
 * @param  muteSyncAllDac: mute Sync All DAC Channle
 * @param  dac_id: dac id
 * @param  mute: Mute Or Not
 *
 * @return None
 *
*******************************************************************************/
BL_Err_Type Audio_DAC_Set_Mute(BL_Fun_Type muteSyncAllDac, Audio_DAC_ID_Type dac_id, Audio_Mute_Type mute)
{
    uint32_t tmpVal = 0;
    uint32_t dacVolumeConfigAddrOffset = AUDIO_BASE + 0x434 + dac_id * 0x08;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(dac_id));
    CHECK_PARAM(IS_AUDIO_MUTE_TYPE(Mute));

    if (muteSyncAllDac) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_S0_MISC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S01_MUTE, mute);
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_S0_MISC, tmpVal);
    } else {
        if (dac_id > 1) {
            return ERROR;
            /*only support 2 dac*/
        }

        tmpVal = BL_RD_WORD(dacVolumeConfigAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_MUTE, mute);
        BL_WR_WORD(dacVolumeConfigAddrOffset, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio adc Volume Config
 *
 * @param  adc_id: adc id
 * @param  cfg: volume config cfg pointer
 *
 * @return None
 *
*******************************************************************************/
BL_Err_Type Audio_ADC_Software_Volume_Config(Audio_ADC_ID_Type adc_id, Audio_Volume_Cfg_Type *cfg)
{
    uint32_t adcVolumeConfigAddrOffset = AUDIO_BASE + 0x408 + adc_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));
    CHECK_PARAM(IS_AUDIO_MUTE_MODE(cfg->muteMode));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->muteRmpdnRate));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->muteRmpupRate));
    CHECK_PARAM(IS_AUDIO_VOLUME_CTR_MODE(cfg->volumeCtrMode));
    CHECK_PARAM(IS_AUDIO_ZERO_CROSS_RATE_TYPE(cfg->resovolumeZeroCrossRatelution));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->volumeRmpRate));

    if (adc_id > 2) {
        return ERROR;
        /*only support 3 adc*/
    }

    tmpVal = BL_RD_WORD(adcVolumeConfigAddrOffset);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_MUTE_SOFTMODE, cfg->muteMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_MUTE_RMPDN_RATE, cfg->muteRmpdnRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_MUTE_RMPUP_RATE, cfg->muteRmpupRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_CTRL_MODE, cfg->volumeCtrMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_CTRL_ZCD_RATE, cfg->volumeZeroCrossRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_CTRL_RMP_RATE, cfg->volumeRmpRate);
    BL_WR_WORD(adcVolumeConfigAddrOffset, tmpVal);

