ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_audio.c
    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);

    if (adc_id == AUDIO_ADC_0) {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_H0_BUSY);
    } else if (adc_id == AUDIO_ADC_1) {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_H1_BUSY);
    } else {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_H2_BUSY);
    }
}

/****************************************************************************/ /**
 * @brief  is audio mute done or not .
 *
 * @param  dac_id: dac id
 *
 * @return is dac mute done
 *
*******************************************************************************/
BL_Sts_Type Audio_IS_DAC_Mute_Set_Done(Audio_DAC_ID_Type dac_id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(dac_id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);

    if (dac_id == AUDIO_DAC_0) {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_DAC_H0_MUTE_DONE);
    } else {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_DAC_H1_MUTE_DONE);
    }
}

/****************************************************************************/ /**
 * @brief  is audio mute & volume set are busy or not .
 *
 * @param  dac_id: dac id
 *
 * @return is dac_id done
 *
*******************************************************************************/
BL_Sts_Type Audio_IS_DAC_Volume_Set_Busy(Audio_DAC_ID_Type dac_id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(dac_id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);

    if (dac_id == AUDIO_DAC_0) {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_DAC_H0_BUSY);
    } else {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_DAC_H1_BUSY);
    }
}

/****************************************************************************/ /**
 * @brief  is audio mute & volume set are busy or not .
 *
 * @param  enable: enable agc
 * @param  cfg: agc cfg
 *
 * @return None
 *
*******************************************************************************/
void Audio_AGC_Init(uint8_t enable, Audio_AGC_Config_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_AGC_SRC_TYPE(cfg->agc_src_select));
    CHECK_PARAM(IS_AUDIO_AGC_DETECT_MODE(cfg->agc_detect_mode));

    if (enable) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_AGC_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_AGC_EN, 0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_FORCE_GAIN_EN, cfg->agc_force_gain_en);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_FORCE_GAIN_IND, cfg->agc_force_gain_ind);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_MAX_GAIN_QDB, cfg->agc_max_gain_qdb);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_MIN_GAIN_QDB, cfg->agc_min_gain_qdb);
        BL_WR_REG(AUDIO_BASE, AUDIO_ADC_AGC_0, tmpVal);

        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_AGC_1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_LEVEL_TARGET, cfg->agc_level_target);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_LEVEL_HYST_ATTACK, cfg->agc_level_hyst_attack);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_LEVEL_HYST_DECAY, cfg->agc_level_hyst_decay);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_HOLD_TIME_MS, cfg->agc_hold_time_ms);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_DECAY_TIME_MS, cfg->agc_decay_time_ms);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_ATTACK_TIME_MS, cfg->agc_attack_time_ms);
        //tmpVal = BL_SET_REG_BITS_VAL(tmpVal,AUDIO_ADC3_PGA_HW_CTRL,cfg->adc3_pga_hw_ctrl); //TODO
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_PGA_HW_CTRL, cfg->adc2_pga_hw_ctrl);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_PGA_HW_CTRL, cfg->adc1_pga_hw_ctrl);
        BL_WR_REG(AUDIO_BASE, AUDIO_ADC_AGC_1, tmpVal);

        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_AGC_2);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_NOISE_GATE_TH, cfg->agc_noise_gate_th);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_NOISE_GATE_HYST, cfg->agc_noise_gate_hyst);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_SILENCE_GAIN_QDB, cfg->agc_silence_gain_qdb);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_SILENCE_GAIN_WAIT_MS, cfg->agc_silence_gain_wait_ms);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_NOISE_ENTER_TIME_MS, cfg->agc_noise_enter_time_ms);
        BL_WR_REG(AUDIO_BASE, AUDIO_ADC_AGC_2, tmpVal);

        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_AGC_3);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_NOISE_EXIT_TIME_MS, cfg->agc_noise_exit_time_ms);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_DBV_SETTLE_TIME, cfg->agc_dbv_settle_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_SRC_SELECT, cfg->agc_src_select);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_DETECT_MODE, cfg->agc_detect_mode);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_ATTACK_TIME, cfg->agc_attack_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_RELEASE_TIME, cfg->agc_release_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_AVERAGE_TIME, cfg->agc_average_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_AGC_PGA_CTRL_EN, cfg->agc_pga_ctrl_en);
        BL_WR_REG(AUDIO_BASE, AUDIO_ADC_AGC_3, tmpVal);

        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_AGC_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_AGC_EN, 1);
        BL_WR_REG(AUDIO_BASE, AUDIO_ADC_AGC_0, tmpVal);

    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_AGC_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_AGC_EN, 0);
        BL_WR_REG(AUDIO_BASE, AUDIO_ADC_AGC_0, tmpVal);
    }
}

/****************************************************************************/ /**
 * @brief  is audio mute & volume set are busy or not .
 *
 * @param  enable: enable drc
 * @param  cfg: drc cfg
 *
 * @return None
 *
*******************************************************************************/
void Audio_DRC_Init(uint8_t enable, Audio_DRC_Config_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DRC_DATA_TYPE(cfg->drc_raw_sel));
    CHECK_PARAM(IS_AUDIO_DRC_DATA_TYPE(cfg->drc_peak_sel));
    CHECK_PARAM(IS_AUDIO_DRC_DATA_TYPE(cfg->drc_avg_sel));
    CHECK_PARAM(IS_AUDIO_DRC_DATA_TYPE(cfg->ngt_src_sel));

    if (enable) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_DRC_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_EN, 0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_RAW_SEL, cfg->drc_raw_sel);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_PEAK_SEL, cfg->drc_peak_sel);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_AVG_SEL, cfg->drc_avg_sel);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_AVG_EN, cfg->drc_avg_en);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_AVG_TIME, cfg->drc_avg_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_ATT_TIME, cfg->drc_att_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_RLS_TIME, cfg->drc_rls_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_NGT_DOWNSAMPLE_EN, cfg->drc_ngt_downsample_en);
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_DRC_0, tmpVal);

        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_DRC_1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_THRESHOLD_L, cfg->drc_threshold_l);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_THRESHOLD_C, cfg->drc_threshold_c);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_THRESHOLD_E, cfg->drc_threshold_e);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_SLOPE_MODE_C, cfg->drc_slope_mode_c);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_SLOPE_MODE_E, cfg->drc_slope_mode_e);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_MAKEUP_GAIN, cfg->drc_makeup_gain);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_ATTACK_TIME, cfg->drc_attack_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_RELEASE_TIME, cfg->drc_release_time);
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_DRC_1, tmpVal);

        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_NGT_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_EN, cfg->ngt_en);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_SRC_SEL, cfg->ngt_src_sel);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_AVG_TIME, cfg->ngt_avg_time);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_THRESHOLD, cfg->ngt_threshold);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_HYSTERESIS, cfg->ngt_hysteresis);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_NOISE_HOLD_EN, cfg->ngt_noise_hold_en);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_NOISE_HOLD_TIME_K, cfg->ngt_noise_hold_time_k);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_SIGNAL_HOLD_EN, cfg->ngt_signal_hold_en);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_SIGNAL_HOLD_TIME_K, cfg->ngt_signal_hold_time_k);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_NGT_DMUTE_ON, cfg->ngt_dmute_on);
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_NGT_0, tmpVal);

        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_ZD_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ZD_EN, cfg->zd_en);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ZD_TIME, cfg->zd_time);
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_ZD_0, tmpVal);

        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_DRC_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_EN, 1);
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_DRC_0, tmpVal);

    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_DRC_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DRC_EN, 0);
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_DRC_0, tmpVal);
    }
}

/****************************************************************************/ /**
 * @brief  Audio interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static void AUDIO_IRQHandler(void)
{
    uint8_t intIndex = 0;

    for (intIndex = 0; intIndex < AUDIO_INT_NUM_ALL; intIndex++) {
        if (Audio_GetIntStatus(intIndex) == SET) {
            if (audioIntCbfArra[intIndex] != NULL) {
                audioIntCbfArra[intIndex]();
            }
            Auido_IntClear(intIndex);
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  Audio Clock Initialization Function
 *
 * @param  cfg: clock configuration pra
 *
 * @return None
 *
*******************************************************************************/
void Audio_Clock_Init(Audio_Clock_CFG_Type *cfg)
{
    uint32_t tmpVal = 0;

