ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_audio.c
    // adc and dac
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_POWER2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_LDO25_PU, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_HPBG_PU, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_POWER2, tmpVal);
}

static void _audio_hwauto_mute(void)
{
    uint32_t tmpVal = 0;

    // update dither
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DSM_DITHER_AMP, 3);
    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_1, tmpVal);

    // update dac_zd_0
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_ZD_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_MUTE_HW_CTRL, 1);//30
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ZD_EN, 3);//16:17
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ZD_TIME, 32000);//0:14
    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_ZD_0, tmpVal);

    // enable automute
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC_RAMP);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_AUTOMUTE_EN, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC_RAMP, tmpVal);
}

void Audio_Analog_Dac(void)
{
    uint32_t tmpVal = 0;

    /*DAC power on*/
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_SDAC_LINEOUT, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_LINEOUT_MODE, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_EN_DAC, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_EN_LINEOUT, 1);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_SDAC_LINEOUT, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_LINEOUT_MODE, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_EN_DAC, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_EN_LINEOUT, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC_RAMP);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_RG_PU_VREF_RAMP, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC_RAMP, tmpVal);

    _audio_hwauto_mute();

    Audio_SetDACAnalogGain(AUDIO_DAC_0, 1);// -3db
    Audio_SetDACAnalogGain(AUDIO_DAC_1, 1);// -3db
}

void Audio_Analog_Dac_Disable(void)
{
    uint32_t tmpVal = 0;

#if 0// lowpower todo
    // ldo power off
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_POWER2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_LDO25_PU, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_HPBG_PU, 0);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_POWER2, tmpVal);
#endif

    /* DAC power off */
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_SDAC_LINEOUT, 0);
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_LINEOUT_MODE, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_EN_DAC, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_EN_LINEOUT, 0);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_SDAC_LINEOUT, 0);
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_LINEOUT_MODE, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_EN_DAC, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_EN_LINEOUT, 0);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC, tmpVal);

#if 0
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC_RAMP);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_RG_PU_VREF_RAMP, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC_RAMP, tmpVal);
#endif
}

void Audio_Analog_Adc(void)
{
    uint32_t tmpVal = 0;

    /* ADC Power on */
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_POWER1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MICBIAS_PU, 1);// mic power select
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MICBIAS_CHOP_EN, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_POWER1, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_EN_SDM, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_EN_PGA, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_PGA_GAIN, 13);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_ICTRL_ADC2, 3);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC0, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_EN_SDM, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_EN_PGA, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_PGA_GAIN, 13);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC1, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_EN_SDM, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_EN_PGA, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_PGA_GAIN, 0);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC2, tmpVal);
}

void Audio_Analog_Adc_Disable(void)
{
    uint32_t tmpVal = 0;

    /* ADC Power on */
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_POWER1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MICBIAS_PU, 0);// mic power select
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MICBIAS_CHOP_EN, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_POWER1, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_EN_SDM, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_EN_PGA, 0);
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_PGA_GAIN, 13);
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_ICTRL_ADC2, 3);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC0, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_EN_SDM, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_EN_PGA, 0);
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_PGA_GAIN, 13);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC1, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_EN_SDM, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_EN_PGA, 0);
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_PGA_GAIN, 0);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC2, tmpVal);
}

void Audio_SetADCAnalogGain(Audio_ADC_ID_Type adc, uint8_t analogGain)
{
    uint32_t tmpVal = 0;

    /*ADC Power on */
    if (adc == AUDIO_ADC_0) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_PGA_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC0, tmpVal);
    } else if (adc == AUDIO_ADC_1) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_PGA_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC1, tmpVal);
    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC2);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_PGA_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC2, tmpVal);
    }
}

void Audio_SetDACAnalogGain(Audio_DAC_ID_Type dac, uint8_t analogGain)
{
    uint32_t tmpVal = 0;

    if (dac == AUDIO_DAC_0) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_LINEOUT_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC, tmpVal);
    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_LINEOUT_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC, tmpVal);
    }
}
/*@} end of group AUDIO_Public_Functions */

/*@} end of group AUDIO */

/*@} end of group BL606P_Peripheral_Driver */
